Repository: adrelanos/menu
Catalog: po/*.po
Languages: pl

source: Zero-size argument to print function.
pl: Podano argument o zerowym rozmiarze do funkcji print.

source: install-menu: checking directory %1
pl: install-menu: sprawdzanie katalogu %1

source: install-menu: creating directory %1:
pl: install-menu: tworzenie katalogu %1:

source: Could not create directory(%1): %2
pl: Nie uda³o siê utworzyæ katalogu(%1): %2

source: Could not change directory(%1): %2
pl: Nie uda³o siê zmieniæ katalogu(%1): %2

source: install-menu: directory %1 already exists
pl: install-menu: katalog %1 ju¿ istnieje

source: install-menu: [supported]: name=%1
pl: install-menu: [supported]: nazwa=%1

source: Menu entry lacks mandatory field "%1".
pl: Brak wymaganego pola "%1" we wpisie menu.

source: Unknown value for field %1="%2".
pl: Nieznana warto¶æ dla pola %1="%2".

source: install-menu: "hotkeycase" can only be "sensitive" or "insensitive"
pl: install-menu: "hotkeycase" mo¿e byæ ustawione tylko na "sensitive" lub "insensitive"

source: install-menu: Warning: Unknown identifier `%1' on line %2 in file %3. Ignoring.
pl: install-menu: Ostrze¿enie: Nieznany identyfikator `%1' w linii %2 w pliku %3. Zignorowano.

source: install-menu: %1 must be defined in menu-method %2
pl: install-menu: %1 musi byæ zdefiniowane w metodzie menu %2

source: Cannot open file %1 (also tried %2).
pl: Nie uda³o siê otworzyæ pliku %1 (ani %2).

source: Cannot open file %1.
pl: Nie uda³o siê otworzyæ pliku %1.

source: In order to be able to create the user config file(s) for the window manager, the above file needs to be writeable (and/or the directory needs to exist).
pl: Aby utworzyæ pliki konfiguracyjne u¿ytkownika dla menad¿era okien potrzebne s± uprawnienia do zapisyania wy¿ej wymienionych plików (i/lub musi istnieæ katalog).

source: Warning: the string %1 did not occur in template file %2
pl: Ostrze¿enie: napis %1 nie wyst±pi³ w pliku szablonu %2

source: install-menu [-vh] <menu-method> Read menu entries from stdin in "update-menus --stdout" format and generate menu files using the specified menu-method. Options to install-menu: -h --help : this message --remove : remove the menu instead of generating it. -v --verbose : be verbose
pl: install-menu [-vh] <metoda-menu> Czyta wpisy menu ze standardowego wej¶cia w formacie "update-menus --stdout" i generuje pliki menu u¿ywaj±c okre¶lonej metody. Opcje install-menu: -h --help : ten komunikat --remove : usuwa menu zamiast tworzyæ -v --verbose : tryb gadatliwy

source: install-menu: no menu-method script specified!
pl: install-menu: nie okre¶lono skryptu metody menu!

source: Cannot open script %1 for reading.
pl: Nie uda³o siê otworzyæ skryptu %1 do odczytu.

source: Warning: script %1 does not provide removemenu, menu not deleted
pl: Ostrze¿enie: skrypt %1 nie umo¿liwia usuwania menu, menu nie skasowane

source: Running: "%1"
pl: Uruchamianie: "%1"

source: install-menu: %1: aborting
pl: install-menu: %1: przerwanie dzia³ania

source: Number of arguments to function %1 does not match.
pl: Nieprawid³owa liczba argumentów funkcji %1.

source: Unknown function: "%1"
pl: Nieznana funkcja: "%1"

source: Indirectly used, but not defined function: "%1"
pl: Po¶rednio u¿yta, ale niezdefiniowana funkcja: "%1"

source: Unknown identifier: "%1"
pl: Nieznany identyfikator: "%1"

source: Encoding conversion error: "%1"
pl: B³±d konwersji kodowania: "%1"

source: Unknown error.
pl: B³êdny b³±d.

source: Unknown error, message=%1
pl: Nieznany b³±d, komunikat=%1

source: Unable to open file "%1".
pl: Nie uda³o siê otworzyæ pliku "%1".

source: Failed to pipe data through "%1" (pipe opened for reading).
pl: Nie uda³o siê przes³aæ danych przez "%1" (potok otwarty do czytania).

source: %1: missing required tag: "%2"
pl: %1: brak wymaganego tagu: "%2"

source: (probably) stdin
pl: (prawdopodobnie) standardowe wej¶cie

source: In file "%1", at (or in the definition that ends at) line %2:
pl: W pliku "%1", w linii (lub w definicji koñcz±cej siê w l.) %2:

source: Somewhere in input file:
pl: Gdzie¶ w pliku wej¶ciowym:

source: Unexpected end of file.
pl: Niespodziewany koniec pliku.

source: Unexpected end of line.
pl: Niespodziewany koniec linii.

source: Identifier expected.
pl: Brak spodziewanego identyfikatora.

source: Expected: "%1"
pl: Spodziewano siê "%1"

source: Unexpected character: "%1"
pl: Niespodziewany znak: "%1"

source: Boolean (either true or false) expected. Found: "%1"
pl: Spodziewano siê warto¶ci logicznej (true lub false). Znaleziono: "%1"

source: Unknown compat mode: "%1"
pl: Nieznany tryb zgodno¶ci: "%1"

source: replacewith($string, $replace, $with): $replace and $with must have the same length.
pl: replacewith($napis, $co, $czym): $co i $czym musz± mieæ identyczn± d³ugo¶æ.

source: file %1 line %2: Discarding entry requiring missing package %3.
pl: plik %1 linia %2: Wpis odrzucony z powodu braku pakietu %3.

source: Reading translation rules in %1.
pl: Wczytywanie regu³ organizacji menu z %1.

source: Reading installed packages list...
pl: Czytanie listy zainstalowanych pakietów...

source: Execution of %1 generated no output or returned an error.
pl: Próba wykonania %1 nie wygenerowa³a danych lub zwróci³a b³±d.

source: Skipping file because of errors...
pl: Plik pominiêty z powodu b³êdów...

source: Reading menu-entry files in %1.
pl: Czytanie plików wpisów menu z %1.

source: Error reading %1.
pl: B³±d odczytu %1.

source: %1 menu entries found (%2 total).
pl: Znalezionych wpisów menu: %1 (w sumie %2).

source: Running method: %1 --remove
pl: Uruchomiona metoda: %1 --remove

source: Script %1 could not be executed.
pl: Nie uda³o siê wykonaæ skryptu %1.

source: Script %1 returned error status %2.
pl: Skrypt %1 zwróci³ kod b³êdu %2.

source: Script %1 received signal %2.
pl: Skrypt %1 odebra³ sygna³ %2.

source: Running method: %1
pl: Uruchomiona metoda: %1

source: Cannot create pipe.
pl: Nie uda³o siê utworzyæ potoku.

source: Running menu-methods in %1.
pl: Wykonywanie metod menu w %1.

source: Other update-menus processes are already locking %1, quitting.
pl: Inne procesy update-menus blokuj± ju¿ %1, wyj¶cie.

source: Cannot lock %1: %2 - Aborting.
pl: Nie uda³o siê zablokowaæ %1: %2 - przerwanie dzia³ania.

source: Cannot write to lockfile %1 - Aborting.
pl: Nie uda³o siê zapisaæ do pliku blokady %1 - przerwanie dzia³ania.

source: Cannot remove lockfile %1.
pl: Nie uda³o siê usun±æ pliku blokady %1.

source: Update-menus is run by user.
pl: Update-menus zosta³ uruchomiony przez u¿ytkownika.

source: Waiting for dpkg to finish (forking to background). (checking %1)
pl: Oczekiwanie na zakoñczenia dzia³ania dpkg (przej¶cie w t³o). (sprawdzanie %1)

source: Further output (if any) will appear in %1.
pl: Wyniki przetwarzania pojawi± siê w %1 (o ile bêd±).

source: Dpkg is not locking dpkg status area, good.
pl: Dpkg nie blokuje obszaru stanu, jest dobrze.

source: Usage: update-menus [options] Gather packages data from the menu database and generate menus for all programs providing menu-methods, usually window-managers. -d Output debugging messages. -v Be verbose about what is going on. -h, --help This message. --menufilesdir=<dir> Add <dir> to the lists of menu directories to search. --menumethod=<method> Run only the menu method <method>. --nodefaultdirs Disable the use of all the standard menu directories. --nodpkgcheck Do not check if packages are installed. --remove Remove generated menus instead. --stdout Output menu list in format suitable for piping to install-menu. --version Output version information and exit.
pl: U¿ycie: update-menus [opcje] Pobiera dane o pakietach z bazy danych menu i generuje menu dla wszystkich programów dostarczaj±cych "metod menu", zazwyczaj mened¿erów okien. -d Wy¶wietla informacje diagnostyczne. -v Wy¶wietla szczegó³owe informacje. -h, --help Ten komunikat. --menufilesdir=<katalog> Dodaje <katalog> do listy katalogów do przeszukania. --menumethod=<metoda> Uruchamia tylko metodê <metoda>. --nodefaultdirs Pomija standardowe katalogi menu. --nodpkgcheck Nie sprawdza, czy pakiety s± zainstalowane. --remove Nie tworzy, tylko usuwa menu. --stdout Wy¶wietla listê menu w formacie odpowiednim do przekazania do install-menu. --version Wy¶wietla informacje o wersji i wychodzi.

source: Unknown install condition "%1" (currently, only "package" is supported).
pl: Nieznany warunek instalacji "%1" (obecnie obs³ugiwany jest tylko "package").
